Revit 2024 API
Element.Name Property
A human readable name for the Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual string Name { get; set; }
Visual Basic
Public Overridable Property Name As String
	Get
	Set
Visual C++
public:
virtual property String^ Name {
	String^ get ();
	void set (String^ value);
}
Remarks
The Name property is a human readable name for the element, such as Wall.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when the name of the element cannot be changed.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when the element requires a unique name and a non-unique name is set.
See Also
Element Class
Autodesk.Revit.DB Namespace